{
  "title": "A Day With CoderNotes",
  "publishedAt": "25th Feb 2020",
  "content": "One of the most common responses I get from people about CoderNotes is that they aren't sure how it can be best used.  Since I personally find that my productivity skyrockets when using CoderNotes, I decided to write a blog post talking about what it's like to add CoderNotes into your workflow, using my actual development session's notes from this past Friday.  We'll be going back through my notes from that day (where I spent ~8 hours getting CoderNotes ready for Alpha), and let's see how I used it, and what value it provided.\n\n## Note #1: Weird or Troublesome Syntax\n\nTo put some context for this one, I was looking to grab some data from my backend's GraphQL endpoint. However, I was dealing with a migration issue after having implemented Algolia. Because of this, I wanted to completely delete a property off of the incoming object if the \"objectID\" column was null or empty. \n\nLike the above, this one took a google search result to find. However, this is really awkward syntax, which uses a reserved keyword in the javascript language itself. Even though this is easily google-able, I knew I wanted to include it in my CoderNotes for future reference. \n\n![](https://landen.imgix.net/blog_zcbvTDNHiuapQvtt/assets/PumOHaiyBSvPcNhN.png)\n\n*(Note: The UI is undergoing a major redesign in March as I get CoderNotes ready for Beta - expect these to look much nicer when you use the app!)*\n\n\n\nImagine that, like me, you had to look this up. What steps are involved in a simple google search?\n\n\n\n\n\n0) Open up a new tab\n\n1) Consider the right way to word it for Google\n\n2) Look at the top three links, how many are ads?\n\n3) Find the non-ad one that seems like the best fit\n\n4) Look through the page, where is the one line that you need from the website?\n\n5) Copy that, paste, and close the new tab\n\n6)  Repeat if you ever need to look this up again\n\n\n\n**Although it only takes a few seconds, it's enough of a task for the brain to engage in task-switching. We're no longer in writing code mode, we're in google search mode.** \n\n\n\nSince this code snippet is something that has tripped me up in the past, I decided to add it to CoderNotes. What does searching look like in CoderNotes?\n\n\n\n![](https://landen.imgix.net/blog_zcbvTDNHiuapQvtt/assets/IObjkoRDZJNHgKLT.gif)",
  "featuredImage": ""
}